In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("datset1.csv")

In [5]:
df.head()

,OrderID,Date,Region,CustomerName,Product,Quantity,UnitPrice,TotalSales,PaymentMethod
0,1001,2023-01-15,North,Alice Johnson,Laptop,2.0,700.0,1400.0,Credit Card
1,1002,2023-01-16,South,Rahul Mehta,Mobile Phone,5.0,300.0,1500.0,UPI
2,1003,2023-01-17,East,Fatima Noor,Headphones,10.0,50.0,500.0,Debit Card
3,1004,2023-01-18,West,NaN,Laptop,1.0,720.0,720.0,Credit Card
4,1005,2023-01-19,North,Zoe Carter,Mobile Phone,3.0,NaN,NaN,UPI

In [6]:
df.tail()

,OrderID,Date,Region,CustomerName,Product,Quantity,UnitPrice,TotalSales,PaymentMethod
15,1016,2023-01-30,West,Alice Johnson,Monitor,3.0,195.0,585.0,Credit Card
16,1017,2023-01-31,North,Daniel Smith,Tablet,2.0,450.0,900.0,UPI
17,1018,2023-02-01,South,Ankit Tiwari,Smart Watch,1.0,200.0,200.0,Wallet
18,1019,2023-02-02,East,Sarah Lee,Mobile Phone,2.0,310.0,620.0,UPI
19,1020,2023-02-03,West,Maria Gonzalez,Laptop,1.0,NaN,700.0,Credit Card

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   OrderID        20 non-null     int64
 1   Date           20 non-null     object
 2   Region         20 non-null     object
 3   CustomerName   18 non-null     object
 4   Product        20 non-null     object
 5   Quantity       19 non-null     float64
 6   UnitPrice      18 non-null     float64
 7   TotalSales     18 non-null     float64
 8   PaymentMethod  20 non-null     object
dtypes: float64(3), int64(1), object(5)
memory usage: 1.5+ KB

In [65]:
df.describe()

           OrderID   Quantity   UnitPrice   TotalSales
count    15.000000  15.000000   15.000000    15.000000
mean   1010.733333   3.200000  310.000000   713.333333
std       5.933761   2.396426  230.666735   451.559467
min    1001.000000   1.000000   50.000000   200.000000
25%    1006.500000   2.000000  147.500000   365.000000
50%    1011.000000   2.000000  290.000000   585.000000
75%    1015.500000   4.000000  380.000000  1040.000000
max    1019.000000  10.000000  710.000000  1500.000000

In [9]:
df.isnull().sum()

OrderID          0
Date             0
Region           0
CustomerName     2
Product          0
Quantity         1
UnitPrice        2
TotalSales       2
PaymentMethod    0
dtype: int64

In [20]:
df.dropna(inplace=True)

In [22]:
df.isnull().sum()

OrderID          0
Date             0
Region           0
CustomerName     0
Product          0
Quantity         0
UnitPrice        0
TotalSales       0
PaymentMethod    0
dtype: int64

# Sum of sales by region

In [34]:
sum_sales = df.groupby('Region')['TotalSales'].sum()

In [37]:
print(sum_sales)

Region
East     2520.0
North    3765.0
South    3830.0
West      585.0
Name: TotalSales, dtype: float64

# Average sales per product

In [38]:
avg_sales = df.groupby('Product')['TotalSales'].mean()

In [39]:
avg_sales

Product
Headphones       415.0
Keyboard         342.5
Laptop          1170.0
Mobile Phone     897.5
Monitor          492.5
Smart Watch      200.0
Tablet           900.0
Name: TotalSales, dtype: float64

# Highest & lowest selling products

In [53]:
selling_product = (df.groupby('Product')['Quantity'].sum()).sort_values()

In [54]:
selling_product

Product
Smart Watch      1.0
Tablet           2.0
Laptop           5.0
Monitor          5.0
Keyboard         7.0
Mobile Phone    12.0
Headphones      16.0
Name: Quantity, dtype: float64

# NumPy to calculate mean, median, standard deviation of TotalSales.

In [56]:
df.head(2)

,OrderID,Date,Region,CustomerName,Product,Quantity,UnitPrice,TotalSales,PaymentMethod
0,1001,2023-01-15,North,Alice Johnson,Laptop,2.0,700.0,1400.0,Credit Card
1,1002,2023-01-16,South,Rahul Mehta,Mobile Phone,5.0,300.0,1500.0,UPI

In [62]:
print(f" mean of TotalSales is: {np.mean(df['TotalSales'])}")

 mean of TotalSales is: 713.3333333333334

In [63]:
print(f" median of TotalSales is: {np.median(df['TotalSales'])}")

 median of TotalSales is: 585.0

In [64]:
print(f" standard deviation of TotalSales is: {np.std(df['TotalSales'])}")

 standard deviation of TotalSales is: 436.24789079400966